[
  {
    "name": "Muscle Power 2",
    "label": "MP2",
    "cost": 26,
    "brand": "Yonex",
    "description": "The Yonex Muscle Power 2 Badminton Racket is a great starter racket and fantastic value for money. This racket weighs in at 98 grams which creates good swing weight through the shuttle and helps to create power.The ISOMETRIC™ equalizes the length of the main and cross strings in the string-bed, enlarging the sweet spot for more consistent accuracy even on off-centre hits.",
    "difficulty": 10,
    "balance": 50,
    "stiff": 50,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/6a40f24e-f32c-4175-912e-62ae08bd5d63.jpg?v=1629732518&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "B4000",
    "label": "B4000",
    "cost": 18,
    "brand": "Yonex",
    "description": "The Yonex B4000 badminton racket is perfect for beginners who are just getting a feel for the game. It features a lightweight aluminium head, making it easy to use whilst maintaining durability. The B4000 is an ideal first racket, helping you to develop powerful, solid shots.",
    "difficulty": 10,
    "balance": 50,
    "stiff": 50,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/e14810a5-6b42-4602-ad9b-95ec6a6f8cc3.jpg?v=1680259721&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "B7000",
    "label": "B7000",
    "cost": 20,
    "brand": "Yonex",
    "description": "The Yonex B700 MDM Muscle Mega Badminton Racket is perfect for developing players learning the game. It features the Mega-Frame design, enabling a larger string bed for a bigger hitting sweet spot, and a strong, aluminium frame for durability",
    "difficulty": 15,
    "balance": 50,
    "stiff": 50,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/69641c19-116d-433e-889a-ba8ee248bb00.jpg?v=1680259704&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Muscle Power 1",
    "label": "MP1",
    "cost": 20,
    "brand": "Yonex",
    "description": "The Yonex Muscle Power 1 Badminton Racket Red is a great starter racket for recreational use. This racket has a balanced racket balance and has a stiff flex allowing for control. This racket weighs in at 93 grams and makes for a great beginner racket.The ISOMETRIC™ equalizes the length of the main and cross strings in the string-bed, enlarging the sweet spot for more consistent accuracy even on off-centre hits.Muscle Power locates the string on rounded archways that eliminate stress-load and fatigue through contact friction. This construction creates total unity of the string and frame through closer and tighter contact.",
    "difficulty": 15,
    "balance": 50,
    "stiff": 50,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/e80616ce-86f2-49f9-b86b-946f62099d55.jpg?v=1680259704&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Astrox E13",
    "label": "AE13",
    "cost": 40,
    "brand": "Yonex",
    "description": "The Yonex Astrox E13 badminton racket is an ideal starter racket for enthusiastic beginners.At 87 grams, this racket is the perfect weight for the improving player: light enough for fast swings but still enough weight to generate power from the rear of the court. The head heavy balance also helps create momentum in swings to help with power generation The E13 also features some of Yonex's signature technologies including:Isometric Head Shape - Developed over 30 years ago, the ISOMETRIC design increases the sweet spot by 7%*. Compared to a conventional round frame, a square-shaped ISOMETRIC racket generates a larger sweet spot by optimizing the intersection of the main and cross strings.Rotational Generator System - By applying the counterbalance theory, weight is distributed throughout the grip end, frame top and the joint for maximum control. The transition to the next shot can be performed smoothly, with rapid succession.Control Support CAP - The control support cap provides an 88% wider flat surface compared with an ordinary racquet for easier gripping, fast follow-through and the sharpest manoeuvrability.Slim Shaft - A slimmer shaft for less air drag and increased swing speed.",
    "difficulty": 25,
    "balance": 70,
    "stiff": 50,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/4fef6b6d-7105-4b7a-9eb4-e79099e09209.jpg?v=1680184945&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Nanoflare 001 Clear",
    "label": "NF1",
    "cost": 40,
    "brand": "Yonex",
    "description": "The Yonex Nanoflare 001 Clear badminton racket is a supremely lightweight starter racket for beginners and also a great choice for juniors transitioning to their first full size racket.At 78 grams, this racket is one of the lightest beginner racket on the market. The head light balance also helps players to manouevre the racket quickly, for easy swinging. The Nanolfare 001 Clear also features some of Yonex's signature technologies including:Aero Frame - Smoother contours throughout the racquet head for less wind resistance and extra racquet speed.Isometric Head Shape - Developed over 30 years ago, the ISOMETRIC design increases the sweet spot by 7%*. Compared to a conventional round frame, a square-shaped ISOMETRIC racket generates a larger sweet spot by optimizing the intersection of the main and cross strings.Control Support CAP - The control support cap provides an 88% wider flat surface compared with an ordinary racquet for easier gripping, fast follow-through and the sharpest manoeuvrability.Slim Shaft - A slimmer shaft for less air drag and increased swing speed.",
    "difficulty": 25,
    "balance": 30,
    "stiff": 25,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/269d8d0a-ecf7-4f64-8c5e-451ed0c78e64.jpg?v=1680184946&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Nanoflare E13",
    "label": "NFE13",
    "cost": 40,
    "brand": "Yonex",
    "description": "The Yonex Nanoflare E13 Turquoise/Yellow badminton racket is an ideal starter racket for enthusiastic beginners.At 87 grams, this racket is the perfect weight for the improving player: light enough for fast swings but still enough weight to generate power from the rear of the court. The head light balance also helps players to manouevre the racket quickly, for easy swinging. The E13 also features some of Yonex's signature technologies including:Isometric Head Shape - Developed over 30 years ago, the ISOMETRIC design increases the sweet spot by 7%*. Compared to a conventional round frame, a square-shaped ISOMETRIC racket generates a larger sweet spot by optimizing the intersection of the main and cross strings.Control Support CAP - The control support cap provides an 88% wider flat surface compared with an ordinary racquet for easier gripping, fast follow-through and the sharpest manoeuvrability.Slim Shaft - A slimmer shaft for less air drag and increased swing speed.",
    "difficulty": 25,
    "balance": 30,
    "stiff": 50,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/c9b06501-668b-4004-8246-20766f15e06c.jpg?v=1680184912&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Arcsaber 11",
    "label": "AS11pl",
    "cost": 55,
    "brand": "Yonex",
    "description": "The Yonex Arcsaber 11 Play Badminton Racket is an incredible beginner/intermediate racket, perfect for keeping power within your game while maintaining control.Isometric Head - Developed over 30 years ago, the ISOMETRICTM design increases the sweet spot by 7%*. Compared to a conventional round frame, a square-shaped ISOMETRICTM racquet generates a larger sweet spot by optimizing the intersection of the main and cross stringsSlim Shaft - Reduces the weight of the racket while increasing the aerodynamic performance.Box Frame - The extra stiff profile provides a solid stable feel on impact with the shuttle.Control Assist Bumper - The CONTROL-ASSIST BUMPER attached at the top contains T-ANCHOR, micro-sized tetrapods that help lock in vertical strings for improved accuracy.",
    "difficulty": 40,
    "balance": 50,
    "stiff": 50,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/8252ec1a-ab66-45ee-89c5-0fce9a185dc0.jpg?v=1646922072&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Arcsaber 7",
    "label": "AS7pl",
    "cost": 50,
    "brand": "Yonex",
    "description": "To keep the shuttle on the string bed for a longer period of time, the Yonex Arcsaber 7 Play frame is made to flex at the point of impact. The Arcsaber offers accurate shot-making for those desiring a greater degree of control by storing and then releasing energy. CS Carbon Nanotubes are positioned at the sidewalls of the racket to increase the frame's flexibility and hold the shuttle on the string bed for better control at the point of impact.Isometric Frame - Developed over 30 years ago, the ISOMETRICTM design increases the sweet spot by 7%*. Compared to a conventional round frame, a square-shaped ISOMETRICTM racket generates a larger sweet spot by optimizing the intersection of the main and cross strings.",
    "difficulty": "35",
    "balance": 50,
    "stiff": 40,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/41561445-f955-4368-bd82-c234f702e61a.jpg?v=1689321970&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Nanoflare Feel",
    "label": "NFF",
    "cost": 65,
    "brand": "Yonex",
    "description": "The Yonex Nanoflare Feel badminton racket is designed for beginner to intermediate club level players looking for a lightweight, fast swinging, and easy to use racket.The Nanoflare range is aimed at players prioritising speed and has been hugely popular with all ability levels The Nanoflare Feel is no exception to this and features a highly flexible frame, providing developing players with extra help in power generation. Despite the whippy, flexible frame, Yonex technologies such as Sonic Flare System ensure the racket is still stable and solid on contact, for great power and control.The Yonex Nanoflare Feel also includes Super Slim Shaft, the slimmest shaft ever produced by Yonex to date! This, combined with the AERO frame design means this racket really cuts through the air at speed, for maxiumum effectiveness in attack and defence.",
    "difficulty": 40,
    "balance": 40,
    "stiff": 20,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/ff34acb2-2511-4cf5-97f0-0a9b759589e8.jpg?v=1680184948&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Nanoflare Clear",
    "label": "NFC",
    "cost": 65,
    "brand": "Yonex",
    "description": " The Yonex Nanoflare Clear is designed for club players and offers great headspeed and manoeuverability with a large sweet spot. Doubles players will appreciate the frame speed during defence and counter attacking play. Nanocell Neo technology helps to dampen vibrations and increase frame resilience.Sonic Flare System places HM Graphite strategically along the frame to optimise repulsion. The super slim shaft, allows faster swing speeds and makes the Nanoflare Clear a joy to play with.",
    "difficulty": 50,
    "balance": 30,
    "stiff": 40,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/ef1b3af9-3f9c-417d-9e7a-baa8598ca2be.jpg?v=1629882884&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Astrox Feel",
    "label": "AF",
    "cost": 75,
    "brand": "Yonex",
    "description": "The Yonex Astrox Feel badminton racket is designed for beginner to intermediate club level players looking for a powerful but forgiving, easy to use racket.The Astrox range is aimed at players prioritising power and has been hugely popular with all ability levels The Astrox Feel is no exception to this and features a highly flexible frame, providing developing players with extra help in power generation. Despite the whippy, flexible frame, Yonex technologies such as Nanomesh Neo and Aero Box Frame ensure the racket is still stable and solid on contact, for great control and feel of the shuttle.The Yonex Astrox Feel also includes Rotational Generator System, applying counterbalance theory to weight distribution to align both power and speed.",
    "difficulty": 40,
    "balance": 70,
    "stiff": 25,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/3c16475b-48a1-465d-8033-072ff717061d.jpg?v=1680184947&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Astrox 77 Play",
    "label": "A77pl",
    "cost": 75,
    "brand": "Yonex",
    "description": "The Yonex Astrox 77 Play is a fantastic value graphite racket and the youngest brother of the 77 Pro (used by some of the worlds best). The Play version is designed to replicate the capabilities of the Pro but in a more user-friendly manner, tailored to suit beginner and intermediate players, at the fraction of the cost.The 77 Play is desgined with power in mind, and suited to doubles or singles players looking to dictate and dominate rallies from the rear of the court with devastating smashes. This power is made more easily available with the high-flex shaft, which is extremely forgiving for players still developing technique and timing.Featuring: AERO+BOX Frame - Combines solid hitting feel and quick swing.ISOMETRIC - Enlarged Sweet Spot - ISOMETRIC technology continues to help the world’s greatest players achieve global success. Developed over 30 years ago, the ISOMETRIC design increases the sweet spot by 7%*. Compared to a conventional round frame, a square-shaped ISOMETRIC racquet generates a larger sweet spot by optimizing the intersection of the main and cross strings.Rotational Generator System - Counterbalanced Weight Distribution - By applying the counterbalance theory, weight is distributed throughout the grip end, frame top and the joint for maximum control. The transition to the next shot can be performed smoothly, with rapid succession.Please be aware that Yonex do not provide a racket case with this racket.",
    "difficulty": 40,
    "balance": 70,
    "stiff": 25,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/c40fc268-81d2-46ce-81d2-0066bbd43591.jpg?v=1667393845&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Nanoflare 1000 Play",
    "label": "NF1000pl",
    "cost": 70,
    "brand": "Yonex",
    "description": "Lightning has struck with the new Yonex Nanoflare 1000 Play Badminton Racket!The Nanoflare 1000 Play is a taken down version of the professional level Nanoflare 1000Z Badminton racket. designed for beginner / intermediate players. This racket features incredible technologies to allow you to advance your game with attacking power.Aero Frame - Smoother contours throughout the racket head for less wind resistance and extra racket speed.Sonic Flare System - The revolutionary new graphite material TORAYCAR M40X and SUPER HMG provide unrivalled power and stability for maximum shuttle acceleration.Isometric - Developed over 30 years ago, the ISOMETRICTM design increases the sweet spot by 7%*. Compared to a conventional round frame, a square-shaped ISOMETRICTM racket generates a larger sweet spot by optimizing the intersection of the main and cross strings.",
    "difficulty": 30,
    "balance": 30,
    "stiff": 55,
    "url": "https://badmintonhq.co.uk/cdn/shop/files/d87377e6-f886-4f44-b39c-463e8b119a43.jpg?v=1686840215&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Astrox 99P",
    "label": "A99pl",
    "cost": 80,
    "brand": "Yonex",
    "description": "The Yonex Astrox 99 Play is the youngest brother of the 99 Pro (used by some of the worlds best) and the 99 Game. The Play version is designed to replicate the capabilities of the 99 Pro but in a more user-friendly manner, tailored to suit the improving beginner or intermediate player.The 99 Play is designed with power in mind, suited to singles or doubles players looking for head heavy punch and relentless steep attacks from the rear of the court.Please be aware that Yonex do not provide a racket case with this racket.",
    "difficulty": 45,
    "balance": 85,
    "stiff": 50,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/5c305b57-2027-4063-b259-a1e388588b1f.jpg?v=1656064974&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Astrox 100G",
    "label": "A100g",
    "cost": 130,
    "brand": "Yonex",
    "description": "The Yonex Astrox 100 Game (4U) is the younger brother of the 100 ZZ (used by some of the worlds best). The Game version is designed to replicate the capabilities of the ZZ but in a more user-friendly manner, tailored to suit the average club player.The 100 Game is desgined with power in mind, suited to singles or doubles players looking for head heavy punch and relentless steep attacks from the rear of the court.Yonex have laced this racket with it's latest technologies, including Nanomesh Neo which ensures a stronger more flexible frame, while increased shaft flex creates maximum power.The 100 Game also includes Rotational Generator System, applying counterbalance theory to weight distribution to align both power and speed.",
    "difficulty": 60,
    "balance": 80,
    "stiff": 55,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/f9a54836-048b-4add-b582-cdc6b5ebea85.jpg?v=1669909707&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Astrox 99G",
    "label": "A99g",
    "cost": 130,
    "brand": "Yonex",
    "description": "The Yonex Astrox 99 Game is the younger brother of the 99 Pro (used by some of the worlds best). The Game version is designed to replicate the capabilities of the 99 Pro but in a more user-friendly manner, tailored to suit the average club player.The 99 Game is desgined with power in mind, suited to singles or doubles players looking for head heavy punch and relentless steep attacks from the rear of the court.Yonex have laced this racket with it's latest technologies, including Nanomesh Neo which ensures a stronger more flexible frame, while increased shaft flex creates maximum power.The 100 Game also includes Rotational Generator System, applying counterbalance theory to weight distribution to align both power and speed.Newly introduced is the Power Assist Bumper which is attached at the top of the frame to enforce heavier, increased power by configuring the weight directed into the shuttlecock with a tungsten-infused nylon bumper.﻿Please be aware that Yonex do not supply a case for this racket. ",
    "difficulty": 55,
    "balance": 85,
    "stiff": 50,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/d30a4183-30cd-4940-9ad1-425c2a70978a.jpg?v=1656064968&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Astrox 88G",
    "label": "A88Dg",
    "cost": 120,
    "brand": "Yonex",
    "description": "The Yonex Astrox 88D Game is the younger brother of the 88D Pro (used by some of the worlds best). The Game version is designed to replicate the capabilities of the Pro but in a more user-friendly manner, tailored to suit the average club player.The 88D Game is desgined with power in mind, and suited to doubles players looking to dictate and dominate rallies from the rear of the court with devastating smashes.Yonex have laced this racket with it's latest technologies, including VOLUME CUT RESIN which increases durability and weight without compromising on strength.Improvements from the VOLUME CUT RESIN can also be seen in the frame and grommets. The frame structure is evolved with a larger sweet spot made possible by the strength-reinforced Isometric head shape. The grommets are improved with a new pattern that uses larger, strategically-placed grommets, a technology that allows more string movement at impact and ultimately increasing shuttle hold for assertive shot-making.*Please note this racket does not include a racket cover. All Yonex rackets introduced into the market from 2021 are no longer supplied with covers for environmental purposes. ",
    "difficulty": 60,
    "balance": 75,
    "stiff": 60,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/bfa4f956-453f-4c1f-8d4f-3b02399000fe.jpg?v=1620373176&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Astrox 22 LT",
    "label": "A22lt",
    "cost": 120,
    "brand": "Yonex",
    "description": "The Yonex Astrox 22 LT Badminton Racket is designed for players that want the ultimate lightweight aggressive power racket. This racket has a heavy head which will help provide more power to your shots, however its also exceptionally light, weighing in at around 63 grams unstrung. This racket has a medium flex making it perfect for intermediate level players requiring easier access to power.Features include:Nanomesh Neo - Ensures a stronger more flexible frame, while increased shaft flex creates maximum power.Rotational Generator System - Counterbalanced Weight Distribution - By applying the counterbalance theory, weight is distributed throughout the grip end, frame top and the joint for maximum control. The transition to the next shot can be performed smoothly, with rapid succession.The ISOMETRIC™ equalizes the length of the main and cross strings in the string-bed, enlarging the sweet spot for more consistent accuracy even on off-centre hits.AERO+BOX Frame - Combines solid hitting feel and quick swing.Control Support Cap - For sharp manoeuvrability, the control support cap provides an 88% wider flat surface compared with an ordinary racquet for easier gripping and fast follow-through.",
    "difficulty": 50,
    "balance": 70,
    "stiff": 55,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/4bbb4b8c-a18a-4739-867d-d3f76191ca2e.jpg?v=1684846338&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Astrox 88G",
    "label": "A88Sg",
    "cost": 120,
    "brand": "Yonex",
    "description": "The Yonex Astrox 88S Game is the younger brother of the 88S Pro (used by some of the worlds best). The Game version is designed to replicate the capabilities of the Pro but in a more user-friendly manner, tailored to suit the average club player.The 88S Game is desgined with a blend of control and power in mind, suited to doubles players looking to dictate play with skill and precision but still looking for head heavy punch from the rear of the court.Yonex have laced this racket with it's latest technologies, including VOLUME CUT RESIN which increases durability and weight without compromising on strength.Improvements from the VOLUME CUT RESIN can also be seen in the frame and grommets. The frame structure is evolved with a larger sweet spot made possible by the strength-reinforced Isometric head shape. The grommets are improved with a new pattern that uses larger, strategically-placed grommets, a technology that allows more string movement at impact and ultimately increasing shuttle hold for assertive shot-making.*Please note this racket does not include a racket cover. All Yonex rackets introduced into the market from 2021 are no longer supplied with covers for environmental purposes. ",
    "difficulty": 60,
    "balance": 65,
    "stiff": 55,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/2f6c6123-a469-4ee1-a139-898ddda234b8.jpg?v=1621324842&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Astrox 100G",
    "label": "A100g",
    "cost": 130,
    "brand": "Yonex",
    "description": "The Yonex Astrox 100 Game is the younger brother of the 100 ZZ (used by some of the worlds best). The Game version is designed to replicate the capabilities of the ZZ but in a more user-friendly manner, tailored to suit the average club player.The 100 Game is desgined with power in mind, suited to singles or doubles players looking for head heavy punch and relentless steep attacks from the rear of the court.",
    "difficulty": 60,
    "balance": 80,
    "stiff": 55,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/d0affb04-b9ce-479b-a096-f45a685adb85.jpg?v=1638014444&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Nanoflare 370 Speed",
    "label": "NF370",
    "cost": 130,
    "brand": "Yonex",
    "description": "The Yonex Nanoflare 370 Speed Badminton Racket is perfectly suited for the intermediate player that wants speed and power whilst still maintaining accuracy. This racket has a head light head balance and a stiff flex which ensures maximum power for speedy players. The racket weighs in at 83 grams.The ISOMETRIC™ equalizes the length of the main and cross strings in the string-bed, enlarging the sweet spot for more consistent accuracy even on off-centre hits.‘NEW’ Built-in T-Joint is manufactured from a special lightweight plastic combined with epoxy resin and foaming agent that enhances quality and performance by increasing the stability of the shuttle on the string bed and through the air.The slimmest racquet ever produced by YONEX vastly reduces air resistance whilst providing maximum feel.The control support cap provides an 88% wider flat surface compared with an ordinary racquet for easier gripping, fast follow-through and the sharpest manoeuvrability.The single-pass grommet hole construction provides more grommet holes for a more high-performance stringing pattern.Decreases air resistance and realizes a quicker swing. ",
    "difficulty": 50,
    "balance": 30,
    "stiff": 70,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/889d04de-1baa-4579-8a61-4bcea3f8dd6b.jpg?v=1673526256&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Astrox Nextage",
    "label": "AN",
    "cost": 120,
    "brand": "Yonex",
    "description": "The Yonex Astrox Nextage 4U Badminton Racket is the key to unfiltered power with an addictive feel. This racket is designed for club level players looking for more power and to bring their game to the next level.The Nextage is designed to deliver premium Yonex quality in a more user friendly frame. The medium flex gives the racket a softer, more forgiving feel than many of the professional Japan frames and will deliver easy power. We at BadmintonHQ love the muted colorway.  Consisting of a black base with dark green accents, the Astrox Nextage is finished off with a matte finish, creating a luxurious and chic aesthetic, packed with incredible technologies to ensure premium feel and advanced level play.Nanomesh NEO - Ensures a stronger more flexible frame, while increased shaft flex creates maximum power.AERO + BOX Frame - Combines a solid hitting feel and a quick swing.Rotational Generator System - Counterbalanced weight distribution. By applying the counterbalance theory, weight is distributed throughout the grip end, frame top and the joint for maximum control. The transition to the next shot can be performed smoothly with rapid succession.Super Slim Shaft - Reduced air resistance. The slimmest racket ever produced by Yonex vastly reduces air resistance whilst providing maximum feel.Energy Boost Cap Plus - Uniquely shaped cap which maximizes shaft performance.The front allows the shaft to flex, while the sides arch-shaped curve stabilizes the racket face by preventing the shaft from twisting.Vibration Dampening Mesh - Vibration Dampening Mesh, VDM, is a stretchy mesh material rolled with the carbon to reduce unwanted vibrations.",
    "difficulty": 60,
    "balance": 80,
    "stiff": 50,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/b1d11b73-4701-4de1-b0f7-0931ee079fce.jpg?v=1675856424&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Nanoflare 1000 Game",
    "label": "NF1000g",
    "cost": 120,
    "brand": "Yonex",
    "description": "Lightning has struck with the new Yonex Nanoflare 1000 Game Badminton Racket!The Nanoflare 1000 Game is a taken down version of the professional level Nanoflare 1000Z Badminton racket. designed for intermediate players. This racket features a whole host of incredible technologies to allow you to advance your game with attacking power.Nanocell NEO - A resilient yet flexible graphite materialAero Frame - Smoother contours throughout the racket head for less wind resistance and extra racket speed.Sonic Flare System - The revolutionary new graphite material TORAYCAR M40X and SUPER HMG provide unrivalled power and stability for maximum shuttle acceleration.Built-in T-Joint - Increases strength between the frame and shaft eliminating head twist for more control.Energy Boost Cap Plus - Uniquely shaped cap which maximizes shaft performance.The front allows the shaft to flex, while the sides arch-shaped curve stabilizes the racket face by preventing the shaft from twisting.",
    "difficulty": 50,
    "balance": 30,
    "stiff": 55,
    "url": "https://badmintonhq.co.uk/cdn/shop/files/4483aac8-d420-4bbf-911d-88dc9ddc827e.jpg?v=1686840214&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Astrox 88D Tour",
    "label": "A88t",
    "cost": 175,
    "brand": "Yonex",
    "description": "The Yonex Astrox 88D Tour is the younger brother of the 88D Pro (used by some of the worlds best). The Tour version is designed to replicate the capabilities of the Pro but at an easier price point and tailored to suit the advanced club or county player.The 88D Tour is designed with power in mind, suited to doubles players looking to dictate play with heavy power from the rear of the court. The introduction of VOLUME CUT RESIN into the 88D Tour adds strength to the frame and a new stringing pattern creates a more compact and solid feel through the hit.This Tour version features a Rexis Shaft, a high-performance shaft precisely designed with an original Yonex molding technique to improve shot performance.The ASTROX series are distinguished by the Rotational Generator System, our intricate weight distribution technology designed with the counterbalance theory that allows head-heavy racquets to recover faster between shots. By employing the VOLUME CUT RESIN, the new 88 S/D models have a further refined Rotational Generator System where intricate weight distribution can be taken to the next level.Improvements*1 from the VOLUME CUT RESIN can also be seen in the frame and grommets. The frame structure is evolved with a larger sweet spot made possible by the strength-reinforced Isometric head shape. The grommets are improved with a new pattern that uses larger, strategically-placed grommets, a technology that allows more string movement at impact and ultimately increasing shuttle hold for assertive shot-making. The 88 S models, designed for front-court players, will have longer shuttle hold for precise net control and the 88 D models, designed for back-court players, will balance repulsion and shuttle hold for maximum power.The ever popular ISOMETRIC frame has also been tweaked to create an EXPANDED SWEET SPOT - 2.9% larger than previous models. With attention paid to every detail, Yonex has even redesigned the cap at the top of the handle to reduce shaft twisting and increase flexibility. For those who like to place their thumb at the top of the grip whilst serving, the indent in the ENERGY BOOST CAP also provides a comfortable and stable place for the thumb to sit. By utilizing high quality Namd graphite throughout the shaft and frame, more flex is produced with a faster snapback, unleashing dramatic steep power. The material stays flexible even with increased swing speed, bending when swing speed increases and restoring its original hard shape at the end of the swing. The ability to bend even further and snap back rapidly, produces stronger shots and greater smash speeds.*Please note this racket does not include a racket cover. All Yonex rackets introduced into the market from 2021 are no longer supplied with covers for environmental purposes.",
    "difficulty": 65,
    "balance": 85,
    "stiff": 75,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/80862f33-fa35-4ba3-8416-73ce4ea82062.jpg?v=1678969724&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Arcsaber 7 Pro",
    "label": "AS7p",
    "cost": 190,
    "brand": "Yonex",
    "description": "The Yonex Arcsaber 7 Pro badminton racket is an exciting update of the original Arcsaber 7, which was released back in 2007 and was a favourite with many players worldwide.The Arcsaber 7 Pro is made in Japan, guaranteeing quality and is designed for the all-round player, looking to combine power speed and control. The medium flex frame is forgiving and allows power generation on less explosive swings with a softer, whippier feel. This 4U/G5 version will likely suit experienced doubles players wanting a frame that will benefit them evenly in all parts of the court, in an all-round game style.Yonex have streamlined this latest edition, introducing a slimmer shaft for greater speed and a completely new frame design. The built-in solid feel core cuts harmful miscellaneous vibration at impact and continues on the forgiving comfortable feel that is synonymous with the Arcsaber range. Yonex have engineered this racket around the concept of 'hold for flight', meaning increased shuttle hold on the strings at impact, for greater control and feel.Featuring:ISOMETRIC Enlarged Sweet Spot - The ISOMETRIC design increases the sweet spot by 7% compared to a conventional round frame. ISOMETRIC delivers greater control without sacrificing power.Ultra PE Fiber - The shaft is constructed using ‘Ultra PEF’ – ultra poly ethylene fibre – which is light enough to float on water yet able to withstand immense forces. These characteristics allow for maximum shock absorption.Super Slim Shaft - The slimmest racquet ever produced by YONEX vastly reduces air resistance whilst providing maximum feel.Energy Boost CAP -The new cap shape allows the shaft to flex, which ensures the maximum effect of “Namd (more flex and faster kick-back graphite material)” and stabilizes the racquet face by preventing the shaft twisting, increasing control.T-ANCHOR - A new composite material T-ANCHOR used in the T-joint helps reduce excess torque when hitting an off centre shot, making the racket more forgiving and easier to use.Box Frame - The extra stiff profile provides a solid stable feel on impact with the shuttle.POCKETING BOOSTER - The frame is lined with POCKETING BOOSTER, a proprietary rubber-like material emphasizing elasticity in the frame’s flex.Enhanced Arcsaber Frame - Control with confidence through this unique frame structure with varying levels of flex from top, sides, to bottom, built to increase shuttle hold while reducing instability and twisting at impact.",
    "difficulty": 75,
    "balance": 50,
    "stiff": 50,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/3ce683cf-348c-4b3e-b7a1-a7c3d9999ad6.jpg?v=1663754339&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Astrox 100 Tour",
    "label": "A100t",
    "cost": 210,
    "brand": "Yonex",
    "description": "The Yonex Astrox 100 Tour 3U Kurenai Badminton Racket is one of the best attacking rackets on the market. With a head heavy balance, stiff shaft and 28lbs maximum string tension, the Astrox 100 Tour will generate all the power you need in your game.NAMD - A world-first, new dimension graphite material, NAMD, greatly improves the adhesion of the graphite fibers and resin by attaching nanomaterial directly to the graphite fiber.  This major improvement produces a shaft that flexes and stores energy, delivering explosive force on impact with the shuttle.Rotational Generator System - By applying the counterbalance theory, weight is distributed throughout the grip end, frame top and the joint for maximum control. The transition to the next shot can be performed smoothly, with rapid succession.Solid Feel Core - The built-in solid feel core cuts harmful miscellaneous vibration at impact. Solid feel core is carried in all rackets manufactured in Japan.Energy Boost CAP PLUS - Uniquely shaped cap which maximizes shaft performance.The front allows the shaft to flex, while the sides arch-shaped curve stabilizes the racket face by preventing the shaft from twisting.",
    "difficulty": 75,
    "balance": 80,
    "stiff": 80,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/a3fb7bc1-7f97-4c89-9d63-c2fdc2ef2155.jpg?v=1658156298&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Arcsaber 11 Pro",
    "label": "AS11p",
    "cost": 210,
    "brand": "Yonex",
    "description": "The Yonex Arcsaber 11 Pro badminton racket is the latest update to one of Yonex's best selling rackets. The Arcsaber 11 Pro is the premier racket for the all-round player, looking to combine power speed and control.FeaturingISOMETRIC Enlarged Sweet Spot - The ISOMETRIC design increases the sweet spot by 7% compared to a conventional round frame. ISOMETRIC delivers greater control without sacrificing power.Ultra PE Fiber - The shaft is constructed using ‘Ultra PEF’ – ultra poly ethylene fibre – which is light enough to float on water yet able to withstand immense forces. These characteristics allow for maximum shock absorption.Super Slim Shaft - The slimmest racquet ever produced by YONEX vastly reduces air resistance whilst providing maximum feel.Energy Boost CAP -The new cap shape allows the shaft to flex, which ensures the maximum effect of “Namd[1](more flex and faster kick-back graphite material)” and stabilizes the racquet face by preventing the shaft twisting, increasing control.T-ANCHOR - A new composite material T-ANCHOR used in the T-joint helps reduce excess torque when hitting an off centre shot, making the racket more forgiving and easier to use.  Super HMG - Super High modulus graphite Box Frame - The extra stiff profile provides a solid stable feel on impact with the shuttle. POCKETING BOOSTER - The frame is lined with POCKETING BOOSTER, a proprietary rubber-like material emphasizing elasticity in the frame’s flex. CONTROL-ASSIST BUMPER - The CONTROL-ASSIST BUMPER attached at the top contains T-ANCHOR, micro-sized tetrapods that help lock in vertical strings for improved accuracy.",
    "difficulty": 75,
    "balance": 55,
    "stiff": 70,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/a769964d-1c6e-4d3b-a28c-1b15eca10af6.jpg?v=1673967291&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Astrox 88D Pro",
    "label": "88Dp",
    "cost": 220,
    "brand": "Yonex",
    "description": "New for 2021, Yonex continue to push boundaries with the revolutionary Astrox 88D Pro.This racket has been designed specifically with the rear court doubles specialist in mind, injecting deadly pace and power into every shot.The 88D Pro features a 10mm longer shaft for incredible power and angle from the rear court.Another update from the previous 88D model is a fully recessed frame which means a more aerodynamic profile and quicker head speed. Yonex have also lengthened the handle from the previous 88D, for greater handling and control when gripping higher up the racket.The introduction of VOLUME CUT RESIN into the 88D Pro adds strength to the frame and a new stringing pattern creates a more compact and solid feel through the hit.The ASTROX series are distinguished by the Rotational Generator System, our intricate weight distribution technology designed with the counterbalance theory that allows head-heavy racquets to recover faster between shots. By employing the VOLUME CUT RESIN, the new 88 S/D models have a further refined Rotational Generator System where intricate weight distribution can be taken to the next level.Improvements*1 from the VOLUME CUT RESIN can also be seen in the frame and grommets. The frame structure is evolved with a larger sweet spot made possible by the strength-reinforced Isometric head shape. The grommets are improved with a new pattern that uses larger, strategically-placed grommets, a technology that allows more string movement at impact and ultimately increasing shuttle hold for assertive shot-making. The 88 S models, designed for front-court players, will have longer shuttle hold for precise net control and the 88 D models, designed for back-court players, will balance repulsion and shuttle hold for maximum power.The ever popular ISOMETRIC frame has also been tweaked to create an EXPANDED SWEET SPOT - 2.9% larger than previous models. With attention paid to every detail, Yonex has even redsigned the cap at the top of the handle to reduce shaft twisting and increase flexibility. For those who like to place their thumb at the top of the grip whilst serving, the indent in the ENERGY BOOST CAP also provides a comfortable and stable place for the thumb to sit. By utilizing high quality Namd graphite throughout the shaft and frame, more flex is produced with a faster snapback, unleashing dramatic steep power. The material stays flexible even with increased swing speed, bending when swing speed increases and restoring its original hard shape at the end of the swing. The ability to bend even further and snap back rapidly, produces stronger shots and greater smash speeds.The ASTROX 88 S PRO and ASTROX 88 D PRO are set to debut on court in March by players such as men’s doubles world no.1 Kevin S. Sukamuljo and Marcus F. Gideon, and women’s doubles world no. 2 Yuki Fukushima and Sayaka Hirota*2.*Please note this racket does not include a racket cover. All Yonex rackets introduced into the market from 2021 are no longer supplied with covers for environmental purposes. ",
    "difficulty": 80,
    "balance": 90,
    "stiff": 80,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/c3856eb9-6cef-474c-989d-1b3e304c6d6e.jpg?v=1621334253&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Nanoflare 700",
    "label": "NF700",
    "cost": 220,
    "brand": "Yonex",
    "description": "The Yonex Nanoflare 700 Badminton Racket has been made for rapid speed attack in doubles, combined with extra power in the headset via a double thickness wall in the frame. The racket is designed for advanced players who love to rely on speed and change of pace in their game to win points.It's a racket that perfectly suits the fast flat game often seen in higher level doubles matches. It features a medium flex meaning it'll suit a wide range of player strengths, with a light head allowing extremely fast racket head reactions, particular when defending smashes or in flat rallies.The ISOMETRIC™ equalizes the length of the main and cross strings in the string-bed, enlarging the sweet spot for more consistent accuracy even on off-centre hits.The built-in solid feel core cuts harmful miscellaneous vibration at impact. Solid feel core is carried in all racquets manufactured in Japan.Combines solid hitting feel and quick swing.‘NEW’ Built-in T-Joint is manufactured from a special lightweight plastic combined with epoxy resin and foaming agent that enhances quality and performance by increasing the stability of the shuttle on the string bed and through the air.The slimmest racquet ever produced by YONEX vastly reduces air resistance whilst providing maximum feel.The control support cap provides an 88% wider flat surface compared with an ordinary racquet for easier gripping, fast follow-through and the sharpest maneuverability.Torayca MX Carbon Fibers Boast Higher Compressive Strength & Tensile Modulus In the development of the Torayca MX series, Toray further pursued both fiber strength and tensile modulus, which are in a trade-off relationship, to the utmost limit and applied technology to improve the orientation by closely controlling the graphite crystal structure in a nano order. It succeeded in improving the tensile strength of M40X, the first variety of Torayca MX series, by about 30% while retaining the equivalent tensile modulus to conventional carbon fibers.The single-pass grommet hole construction provides more grommet holes for a more high-performance stringing pattern.",
    "difficulty": 75,
    "balance": 25,
    "stiff": 50,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/58be55b6-a1b4-42a6-8cf3-a027df14a192.jpg?v=1656064877&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Astrox 99 Pro",
    "label": "A99p",
    "cost": 235,
    "brand": "Yonex",
    "description": "The Yonex Astrox 99 Pro Cherry Sunburst (4U) is a pure power racket and a complete re-design of the previous Astrox 99. The 4U weight is suited to doubles players or singles players who prefer a more maneuverable racket. Designed in conjuction with World #1 and 2 x World Champion Kento Momota, the Astrox 99 Pro offers the heaviest swing weight of any in the ASTROX series for devastating rear court power. POWER ASSIST BUMPER, a tungsten-infused nylon bumper, has been added to the top of the frame for increased swingweight and power. ROTATIONAL GENERATOR SYSTEM offers counterbalanced weight distribution, with weight optimised in key areas of the racket for max control and shot transition. NAMD, Yonex's revolutionary and premier graphite material is now present in both the shaft and the racket head. VOLUME CUT RESIN, an epoxy resin that has been used to construct the entire frame of the racket, is lighter in weight and has excellent strength, allowing it to support the new extra slim shaft.Yonex have however, worked hard to ensure that all the extra headweight does not come at the expense of speed and have introduced an EXTRA SLIM SHAFT and fully recessed frame. Yonex have also refined the ISOMETRIC HEADSHAPE, for greater forgiveness and an optimised sweetspot. This is combined with a new stringing pattern, borrowed from the Astrox 88S, that looks to offer more control and longer shuttle hold.Please note this racket does not include a racket cover. All Yonex rackets introduced into the market from 2021 are no longer supplied with covers for environmental purposes.",
    "difficulty": 95,
    "balance": 95,
    "stiff": 90,
    "url": "https://badmintonhq.co.uk/cdn/shop/files/AX99P_f9125f4c-902b-4d0f-93df-6b67f4e8a2a1.jpg?v=1688471119&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Astrox 88S Pro",
    "label": "A88Sp",
    "cost": 220,
    "brand": "Yonex",
    "description": "New for 2021, Yonex continue to push boundaries with the revolutionary Astrox 88S Pro. This racket has been designed specifically with the all court doubles specialist in mind, injecting deadly pace and power from the rear court but also employing control and creativity from the front. An update from the previous 88S model is a fully recessed frame which means a more aerodynamic profile and quicker head speed.   The introduction of VOLUME CUT RESIN into the 88S Pro adds strength to the frame and a new stringing pattern creates a more compact and solid feel through the hit.The ASTROX series are distinguished by the Rotational Generator System, our intricate weight distribution technology designed with the counterbalance theory that allows head-heavy racquets to recover faster between shots. By employing the VOLUME CUT RESIN, the new 88 S/D models have a further refined Rotational Generator System where intricate weight distribution can be taken to the next level.Improvements*1 from the VOLUME CUT RESIN can also be seen in the frame and grommets. The frame structure is evolved with a larger sweet spot made possible by the strength-reinforced Isometric head shape. The grommets are improved with a new pattern that uses larger, strategically-placed grommets, a technology that allows more string movement at impact and ultimately increasing shuttle hold for assertive shot-making. The 88 S models, designed for front-court players, will have longer shuttle hold for precise net control and the 88 D models, designed for back-court players, will balance repulsion and shuttle hold for maximum power.The ever popular ISOMETRIC frame has also been tweaked to create an EXPANDED SWEET SPOT - 2.9% larger than previous models. With attention paid to every detail, Yonex has even redsigned the cap at the top of the handle to reduce shaft twisting and increase flexibility. For those who like to place their thumb at the top of the grip whilst serving, the indent in the ENERGY BOOST CAP also provides a comfortable and stable place for the thumb to sit. By utilizing high quality Namd graphite throughout the shaft and frame, more flex is produced with a faster snapback, unleashing dramatic steep power. The material stays flexible even with increased swing speed, bending when swing speed increases and restoring its original hard shape at the end of the swing. The ability to bend even further and snap back rapidly, produces stronger shots and greater smash speeds.The ASTROX 88 S PRO and ASTROX 88 D PRO are set to debut on court in March by players such as men’s doubles world no.1 Kevin S. Sukamuljo and Marcus F. Gideon, and women’s doubles world no. 2 Yuki Fukushima and Sayaka Hirota*2.",
    "difficulty": 70,
    "balance": 80,
    "stiff": 65,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/45b4089c-a7b8-4184-8e3e-65fdd4e92af6.jpg?v=1638019663&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Astrox 100 ZZ",
    "label": "A100ZZ",
    "cost": 260,
    "brand": "Yonex",
    "description": "New for 2021, Yonex have raised the technological bar once more with the revolutionary Astrox 100 ZZ Kurenai.Featuring the SLIMMEST SHAFT EVER CREATED BY YONEX, the ZZ is able to slice through the air with reduced resistance. Most traditional rackets feature a hollow core within the racket shaft, however the Hyper Slim Shaft on the ZZ features a solid core graphite construction, providing extra resilience and greater power transfer.The ever popular ISOMETRIC frame has also been tweaked to create an EXPANDED SWEET SPOT - 2.9% larger than previous models. With attention paid to every detail, Yonex has even redsigned the cap at the top of the handle to reduce shaft twisting and increase flexibility.For those who like to place their thumb at the top of the grip whilst serving, the indent in the ENERGY BOOST CAP also provides a comfortable and stable place for the thumb to sit. By utilizing high quality Namd graphite throughout the shaft and frame, more flex is produced with a faster snapback, unleashing dramatic steep power. The material stays flexible even with increased swing speed, bending when swing speed increases and restoring its original hard shape at the end of the swing. The ability to bend even further and snap back rapidly, produces stronger shots and greater smash speeds.The weapon of choice for former World and European Singles Champion, Viktor Axelson.",
    "difficulty": "90",
    "balance": 85,
    "stiff": 90,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/e132de1d-2584-4d08-9125-7c1c6e37cd0e.jpg?v=1649926786&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Nanoflare 800",
    "label": "NF800",
    "cost": 230,
    "brand": "Yonex",
    "description": "The Yonex Nanoflare 800 3U Badminton Racket has been made for rapid speed attack, combined with extra power in the headset via a double thickness wall in the frame. The racket is designed for advanced players who love to rely on speed and change of pace in their game to win points.It's a racket that perfectly suits the fast flat game often seen in higher level doubles matches. It features a stiff flex shaft for ultimate precision, with a light head allowing extremely fast racket head reactions, particular when defending smashes or in flat rallies.This 3U version provides adds a more powerful edge to the speed of the Nanoflare frame.The ISOMETRIC™ equalizes the length of the main and cross strings in the string-bed, enlarging the sweet spot for more consistent accuracy even on off-centre hits.The built-in solid feel core cuts harmful miscellaneous vibration at impact. Solid feel core is carried in all racquets manufactured in Japan.Combines solid hitting feel and quick swing.‘NEW’ Built-in T-Joint is manufactured from a special lightweight plastic combined with epoxy resin and foaming agent that enhances quality and performance by increasing the stability of the shuttle on the string bed and through the air.The slimmest racquet ever produced by YONEX vastly reduces air resistance whilst providing maximum feel.The control support cap provides an 88% wider flat surface compared with an ordinary racquet for easier gripping, fast follow-through and the sharpest maneuverability.Torayca MX Carbon Fibers Boast Higher Compressive Strength & Tensile Modulus In the development of the Torayca MX series, Toray further pursued both fiber strength and tensile modulus, which are in a trade-off relationship, to the utmost limit and applied technology to improve the orientation by closely controlling the graphite crystal structure in a nano order. It succeeded in improving the tensile strength of M40X, the first variety of Torayca MX series, by about 30% while retaining the equivalent tensile modulus to conventional carbon fibers.The single-pass grommet hole construction provides more grommet holes for a more high-performance stringing pattern.",
    "difficulty": "75",
    "balance": 25,
    "stiff": 75,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/b3819fe6-3465-4889-9aa8-e27f28514ec3.jpg?v=1664463687&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Nanoflare 800LT",
    "label": "NF800LT",
    "cost": 240,
    "brand": "Yonex",
    "description": "The Yonex Nanoflare 800 LT Badminton Racket is the lighter version of the hugely popular Nanoflare 800.  Designed for rapid speed attack and defence, this racket is for advanced players who love to rely on speed and change of pace in their game to win points. The Nanoflare 800 LY is best suited to the fast flat game often seen in higher level doubles matches. It features a stiff flex shaft for ultimate precision, with a light head allowing extremely fast racket head reactions, particular when defending smashes or in flat rallies.The ISOMETRIC™ equalizes the length of the main and cross strings in the string-bed, enlarging the sweet spot for more consistent accuracy even on off-centre hits.The built-in solid feel core cuts harmful miscellaneous vibration at impact. Solid feel core is carried in all racquets manufactured in Japan.Combines solid hitting feel and quick swing.‘NEW’ Built-in T-Joint is manufactured from a special lightweight plastic combined with epoxy resin and foaming agent that enhances quality and performance by increasing the stability of the shuttle on the string bed and through the air.Ultra slim shaft, one of the slimmest ever produced by YONEX vastly reduces air resistance whilst providing maximum feel.The control support cap provides an 88% wider flat surface compared with an ordinary racquet for easier gripping, fast follow-through and the sharpest maneuverability.Torayca MX Carbon Fibers Boast Higher Compressive Strength & Tensile Modulus In the development of the Torayca MX series, Toray further pursued both fiber strength and tensile modulus, which are in a trade-off relationship, to the utmost limit and applied technology to improve the orientation by closely controlling the graphite crystal structure in a nano order. It succeeded in improving the tensile strength of M40X, the first variety of Torayca MX series, by about 30% while retaining the equivalent tensile modulus to conventional carbon fibers.The single-pass grommet hole construction provides more grommet holes for a more high-performance stringing pattern.",
    "difficulty": 75,
    "balance": 25,
    "stiff": 75,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/be39d9ae-5f98-482f-af61-2bf702d6d6d4.jpg?v=1684916119&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Nanoflare 1000 Tour",
    "label": "NF1000t",
    "cost": 170,
    "brand": "Yonex",
    "description": "Lightning has struck with the new Yonex Nanoflare 1000 Tour Badminton Racket!This incredible  racket from Yonex offers uncharted shuttle speeds with more technologies than you can imagine. The Nanoflare 1000 is designed for advanced level players looking for additional shot and swing speed with agile maneuverability. Nanocell NEO - A resilient yet flexible graphite materialAero Frame - Smoother contours throughout the racket head for less wind resistance and extra racket speed.Compact Frame - To balance the heavy racket head, the frame has been made smaller to maintain the fast swing demanded by advanced players. By reducing the drag caused by air resistance, the head-heavy feeling is reduced and racket handling speed is increased.Sonic Flare System - The revolutionary new graphite material TORAYCAR M40X and SUPER HMG provide unrivalled power and stability for maximum shuttle acceleration.Built-in T-Joint - Increases strength between the frame and shaft eliminating head twist for more control.Speed-Assist Bumper - The SPEED-ASSIST BUMPER is a connected grommet containing highly rigid material that is resistant to warping. They are attached to the lower part of the frame to reduce frame warp and improve repulsion performance.",
    "difficulty": 80,
    "balance": 30,
    "stiff": 85,
    "url": "https://badmintonhq.co.uk/cdn/shop/files/1456ee42-3b0a-4a89-89c2-d0d5950159ec.jpg?v=1686840217&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Nanoflare 1000 Z",
    "label": "NF1000",
    "cost": 230,
    "brand": "Yonex",
    "description": "Lightning has struck with the new Yonex Nanoflare 1000 Z Badminton Racket!The Nanoflare 1000Z is a record breaking racket. Used by Satwick Rankireddy and Pearly Tan to set the new world record for fastest smash, 565km/h and 438km/h respectively!This new flagship racket from Yonex offers uncharted shuttle speeds with more technologies than you can imagine. The Nanoflare 1000 is designed for players looking for additional shot and swing speed with agile maneuverability. The new NANOFLARE 1000 is being used on court now in the hands of Rio Olympic gold medalist, Carolina Marin (ESP), 2022 All England silver medalist, Lakshya Sen (IND), and 2022 French Open champion, He Bing Jiao (CHN). Nanometric DR - NANOMETRIC DR is a new carbon material developed by Yonex based on our unique NANOSCIENCE technology. Created from a material originally developed for next generation space aviation by Toray Industries, Inc., this marks the first time it has been used within the racket industry. By combining firm shuttle hold and high repulsion, NANOMETRIC DR puts the DUORA into a class of its own.Compact Frame - To balance the heavy racket head, the frame has been made smaller to maintain the fast swing demanded by advanced players. By reducing the drag caused by air resistance, the head-heavy feeling is reduced and racket handling speed is increased.M40X - A next-generation highly strong, yet elastic carbon fiber developed by Toray Industries, Inc.Solid Feel Core - The built-in solid feel core cuts harmful miscellaneous vibration at impact. Solid feel core is carried in all rackets manufactured in Japan.Sonic Flare System - The revolutionary new graphite material TORAYCAR M40X and SUPER HMG provide unrivalled power and stability for maximum shuttle acceleration.Ultra PE Fiber - The shaft is constructed using ‘Ultra PEF’ – ultra poly ethylene fibre – which is light enough to float on water yet able to withstand immense forces. these characteristics allow for maximum shock absorption.NEW Built-in T-Joint - The lightweight T-Joint increases stability of the shuttle on the strings, maximizing power and control.Speed-Assist Bumper - The SPEED-ASSIST BUMPER is a connected grommet containing highly rigid material that is resistant to warping. They are attached to the lower part of the frame to reduce frame warp and improve repulsion performance.",
    "difficulty": 90,
    "balance": 30,
    "stiff": 90,
    "url": "https://badmintonhq.co.uk/cdn/shop/files/f89842e9-ded5-4af0-8e6a-dc7bb744b322.jpg?v=1686840219&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Astrox 88P",
    "label": "A88pl",
    "cost": 70,
    "brand": "Yonex",
    "description": " The Yonex Astrox 88D Play is a fantastic value graphite racket and the youngest brother of the 88D Pro (used by some of the worlds best) and the 88D Game. The Play version is designed to replicate the capabilities of the Pro but in a more user-friendly manner, tailored to suit beginner and intermediate players, at the fraction of the cost.  The 88D Play is desgined with power in mind, and suited to doubles players looking to dictate and dominate rallies from the rear of the court with devastating smashes. This power is made more easily available with the medium flex shaft, which is more forgiving for players still developing technique and timing. Please be aware that Yonex do not provide a racket case with this racket.",
    "difficulty": 40,
    "balance": 75,
    "stiff": 50,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/a86a0778-f83f-451e-b35d-ee92b03db529.jpg?v=1638017968&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Astrox 88P",
    "label": "A88Spl",
    "cost": 70,
    "brand": "Yonex",
    "description": " The Yonex Astrox 88S Play is a fantastic value graphite racket and the youngest brother of the 88S Pro (used by some of the worlds best) and the 88S Game. The Play version is designed to replicate the capabilities of the Pro but in a more user-friendly manner, tailored to suit beginner and intermediate players, at the fraction of the cost.  The 88S Play is desgined with a mix of control and power in mind, and suited to doubles players looking to dictate rallies with precision and controlled power. This power is made more easily available with the medium flex shaft, which is more forgiving for players still developing technique and timing.  Please be aware that Yonex do not provide a racket case with this racket.",
    "difficulty": 40,
    "balance": 70,
    "stiff": 50,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/ba5714ec-aa99-4c9a-84bc-14a371350430.jpg?v=1638019669&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Astrox 77 Pro",
    "label": "A77p",
    "cost": 220,
    "brand": "Yonex",
    "description": "The Yonex Astrox 77 Pro 4U badminton racket is the latest version of this popular model, suited to players seeking power but in a more user friendly frame than higher spec versions in the Astrox range.The Astrox 77 Pro is the weapon of choice for Olympic singles champion Chen Yufei.Featuring:Namd - A world-first, new dimension graphite material, Namd, greatly improves the adhesion of the graphite fibers and resin by attaching nanomaterial directly to the graphite fiber.In high performance racquets, it is common to combine nanomaterials with resin that connects graphite fibers, but in Namd, nanomaterials are directly adhered to the graphite fibers and resin is greatly increased. This major improvement produces a shaft that flexes and stores energy, delivering explosive force on impact with the shuttle.AERO+BOX Frame - Combines solid hitting feel and quick swing.ISOMETRIC - ISOMETRIC technology continues to help the world’s greatest players achieve global success. Developed over 30 years ago, the ISOMETRIC design increases the sweet spot by 7%*. Compared to a conventional round frame, a square-shaped ISOMETRIC racquet generates a larger sweet spot by optimizing the intersection of the main and cross strings. ISOMETRIC delivers greater control without sacrificing power.Rotational Generator System - Counterbalanced Weight Distribution. By applying the counterbalance theory, weight is distributed throughout the grip end, frame top and the joint for maximum control. The transition to the next shot can be performed smoothly, with rapid succession.Super Slim Shaft - Reduced Air Resistance. The slimmest racquet ever produced by YONEX vastly reduces air resistance whilst providing maximum feel.Energy Boost CAP PLUS - Uniquely shaped cap which maximizes shaft performance.The front allows the shaft to flex, while the sides arch-shaped curve stabilizes the racquet face by preventing the shaft from twisting.*Please be aware that Yonex no longer supply a cover for this racket due to an innitiative to reduce waste and landfill. ",
    "difficulty": 75,
    "balance": 70,
    "stiff": 65,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/9dfd94b7-7e0f-449a-a82f-e446edf976b7.jpg?v=1667305984&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Nanoray 9",
    "label": "NR9",
    "cost": 40,
    "brand": "Yonex",
    "description": "The Yonex Nanoray 9 Badminton Racket Royal Blue is a great beginner racket and is perfect for players just getting into the sport. This racket has a head light balance and HI-FLEX offering ease and playability around the court. This racket weighs in at a modest 88 grams.IMPORTANT: This racket comes with original specialist strings and tensions already applied for longer term use from the brand. We recommend you select \"original strings\" when choosing you preferred upgrade option, as it'll save you cost and money in the present and future, unless you're a specialist high level competitive player or someone that specifically wants a certain string & tension.Yonex Nanoray 9 for greater easy to use and good control properties are the outstanding qualities of the Nanoray series. Racket high speed thanks to optimum weight distribution and easy to use Head Weight Distribution. Technology: Nanomesh + Carbon Nano Tube isometric Electric New Grommet Pattern built in t joint, Material: Graphite Nanomesh + Carbon Nano Tube Product",
    "difficulty": 20,
    "balance": 20,
    "stiff": 20,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/e588229d-1ce7-4024-981e-391f2c04f3ec.jpg?v=1601305586&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Duora 99",
    "label": "D99",
    "cost": 125,
    "brand": "Yonex",
    "description": "The Yonex Duora 99 Badminton Racket Black is very well suited for the advanced player that wants to have extra power on the backhand as well. This racket is balanced making it a great fit for players that value speed and power. This racket weighs in a modest 88grams and has a stiff flex which is great for power players with experience.IMPORTANT: This racket comes with original specialist strings and tensions already applied for longer term use from the brand. We recommend you select \"original strings\" when choosing you preferred upgrade option, as it'll save you cost and money in the present and future, unless you're a specialist high level competitive player or someone that specifically wants a certain string & tension.The ISOMETRIC™ equalizes the length of the main and cross strings in the string-bed, enlarging the sweet spot for more consistent accuracy even on off-centre hits.The single-pass grommet hole construction provides more grommet holes for a more high-performance stringing pattern. The control support cap provides an 88% wider flat surface compared with an ordinary racquet for easier gripping, fast follow-through and the sharpest maneuverability.Titanium Mesh racquets demonstrate excellent resistance to the high twisting forces generated at impact and have a mass ideally balanced for more face stability and head speed. YONEX Titanium Mesh fibres are 2.5 times harder and 2.3 times heavier than graphite.Moulded deep into the layers of graphite where the frame connects with the shaft, the YONEX Built-in T-Joint creates a durable and high-strength one-piece frame that is torque-free.",
    "difficulty": 50,
    "balance": 60,
    "stiff": 60,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/a2763e60-c7ff-42c8-a0dd-322f6bbecbe1.jpg?v=1656412300&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Astrox FB",
    "label": "AFB",
    "cost": 70,
    "brand": "Yonex",
    "description": "The Yonex Astrox Flash Boost FB Badminton Racket Navy / Orange is a fantastic lightweight racket, for anyone seeking value for money whilst ensuring that you still have accuracy and power. This racket is head heavy and has a medium flex for easier power generation.This racket weighs in at 73 grams and is well suited to beginners and improving players. Technology includes:Isometric - The ISOMETRIC™ head shape equalizes the length of the main and cross strings in the string-bed, enlarging the sweet spot for more consistent accuracy even on off-centre hits.New Grommet Pattern - Single-pass grommet hole construction provides more grommet holes for a more high-performance stringing pattern.Aero Box Frame - Combines solid hitting feel and quick swing.Control Support Cap -  provides an 88% wider flat surface compared with an ordinary racquet for easier gripping, fast follow-through and the sharpest maneuverability.Rotational Generator System - By applying the counterbalance theory, weight is distributed throughout the grip end, frame top and the joint for maximum control. The transition to the next shot can be performed smoothly with a rapid succession.*Please note this racket does not include a racket cover. All Yonex rackets introduced into the UK market from 2021 are no longer supplied with covers for environmental purposes. ",
    "difficulty": 30,
    "balance": 55,
    "stiff": 65,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/4a616305-6755-4455-964f-bf81cb109ee1.jpg?v=1622041651&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Astrox 01 Clear",
    "label": "A1C",
    "cost": 50,
    "brand": "Yonex",
    "description": "The Astrox 01 Clear is one of the most user friendly rackets ever produced by Yonex and, as part of the Astrox Series, was created to satisfy the requirements of aggressive attacking play.The evenly balanced weight distribution, medium flex in the shaft and 83g weight makes the Astrox 01 Clear extremely smooth to swing and generate easy power. The isometric head shape creates an increased sweet spot size making this an extremely forgiving racket for recreational players or those still developing their technique. AERO+ Box Frame - Combines solid hitting feel and quick swingRotational Generator System - By applying the counterbalance theory, weight is distributed throughout the grip end, frame top and the joint for maximum control. The transition to the next shot can be performed smoothly, with rapid succession.Control Support CAP - The control support cap provides an 88% wider flat surface compared with an ordinary racquet for easier gripping, fast follow-through and the sharpest maneuverability.Slim Shaft",
    "difficulty": 30,
    "balance": 45,
    "stiff": 50,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/8915ec85-dbb6-479a-b431-f84d4836ffda.jpg?v=1673535224&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "ST-1680 ITJ",
    "label": "ST1680",
    "cost": 11.95,
    "brand": "Victor",
    "description": "The Victor ST-168 ITJ Junior badminton racket is a super durable racket, perfect for any beginner or casual player. Featuring a tempered steel construction for increased durability for beginner players.",
    "difficulty": 0,
    "balance": 0,
    "stiff": 0,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/0eadd67a-22ac-4e8e-a4ae-e90e9c9138dd.jpg?v=1644507312&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "AL-2200",
    "label": "AL2200",
    "cost": 13.95,
    "brand": "Victor",
    "description": "The Victor AL-2200 badminton racket is a super durable racket, perfect for any beginner or casual player. With an Aluminium and Steel construction, this racket has been made to last.",
    "difficulty": 0,
    "balance": 0,
    "stiff": 0,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/47eaa496-9ffe-452d-8b30-02944ea36e84.jpg?v=1644507298&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "AL-6500 I",
    "label": "AL6500",
    "cost": 35,
    "brand": "Victor",
    "description": "The Victor AL-6500 I badminton racket is a head heavy attacking racket, ideal for beginner use. Combining an anvil shape for more frame stability and a flexible carbon shaft to gain even more power.Also featuring an internal T-joint for durability and increased power.",
    "difficulty": 0,
    "balance": 0,
    "stiff": 0,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/Vic_110001.jpg?v=1647434067&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "AL-3300",
    "label": "AL3300",
    "cost": 0,
    "brand": "Victor",
    "description": "The Victor AL-3300 badminton racket is a super durable aerodynamic frame, perfect for beginner/casual use.",
    "difficulty": 0,
    "balance": 0,
    "stiff": 0,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/cee3d431-19a2-43b6-9674-207681b0bc72.jpg?v=1644507300&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Ultramate 6",
    "label": "U6",
    "cost": 29,
    "brand": "Victor",
    "description": "Very good entry level model with a shaft made of carbon and a head of aluminium",
    "difficulty": 25,
    "balance": 50,
    "stiff": 50,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/3542ff21-b9fb-450e-a256-d807bc62fca9.jpg?v=1601306330&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Ultramate 7",
    "label": "U7",
    "cost": 39,
    "brand": "Victor",
    "description": "The Victor Ultramate 7  Badminton Racket is a very good entry-level model with a shaft made of carbon and ahead of aluminium. It weighs in at an all-round 85 grams. It offers a good level of comfort and power to any beginner play with its balanced racket balance and medium flex.A full high modulus graphite badmintonracket with a very good price. This racket is equipped with a dynamic frame. The Victor Ultramate 7 has an 'even balance' balancepoint and a stiff shaft, which provides you a very allround racket and a lot of control during the game. This badminton racket has a weight of about 89 gram and can be strung to 22lbs. .",
    "difficulty": 30,
    "balance": 55,
    "stiff": 70,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/a71298ab-1f19-4421-bf22-eff0b3bc3a07.jpg?v=1601306335&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "G-7000",
    "label": "G7000",
    "cost": 50,
    "brand": "Victor",
    "description": "The Victor G-7000 badminton racket is a full carbon beginner racket which provides excellent power to your attacking game.Perfect for improving players, this racket has an 89g weight and is strung with the brilliant Ashaway Rally 21 Fire strings.",
    "difficulty": 0,
    "balance": 0,
    "stiff": 0,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/c082b828-e2d3-4785-a44a-6bfb614395d4.jpg?v=1644507306&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "G-7500",
    "label": "G7500",
    "cost": 50,
    "brand": "Victor",
    "description": "The Victor G-7500 badminton racket is a full carbon beginner racket which provides excellent control and less overall torsion thanks to the stiffer shaft.Perfect for improving players, this racket has an 85g weight and is strung with the brilliant Ashaway Rally 21 Fire strings.",
    "difficulty": 0,
    "balance": 0,
    "stiff": 0,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/52450822-cfdf-4c33-b6a0-0d853305eca2.jpg?v=1644507308&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Thruster K 11",
    "label": "TK11",
    "cost": 100,
    "brand": "Victor",
    "description": "This beginner racket comes with a flexible shaft which generates a lot of power, suporting the player in every single shot. Perfect chice for beginner",
    "difficulty": 30,
    "balance": 60,
    "stiff": 20,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/e2075993-cb34-4a64-9dac-f5588d3e5276.jpg?v=1645198921&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Ultramate 9",
    "label": "U9",
    "cost": 100,
    "brand": "Victor",
    "description": "With head-light balance and a stiff shaft, the Victor Ultramate 9 Badminton Racket is ideal for players looking for high manoeuvrability without losing out on stability. Constructed from High Carbon with a weight of 88 grams, the Ultramate 9 is super easy to play with, allowing for quick swings and aggressive play. ",
    "difficulty": 50,
    "balance": 35,
    "stiff": 80,
    "url": "https://badmintonhq.co.uk/cdn/shop/files/edf30126-ec10-495b-b81b-cc45f0ca6806.jpg?v=1690383145&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Lightfighter 30F",
    "label": "LF30F",
    "cost": 105,
    "brand": "Victor",
    "description": "The Victor Thruster Light Fighter 30 F Badminton racket is the ultimate power racket for intermediate players.This flexible, lightweight racket features the incredible Thruster technology to unleash power in every shot. Constructed with high modulus graphite, the Thruster Light Fighter 30 F weighs a mere 72g!",
    "difficulty": 50,
    "balance": 55,
    "stiff": 30,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/6c661b8f-0c8d-404d-997b-1b3b12987b3c.jpg?v=1684845162&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Auraspeed 11B",
    "label": "A11B",
    "cost": 110,
    "brand": "Victor",
    "description": "This racket offers incredible speed created by the Ultra-Thin Frame, while the flexible shaft offers a lot of power. Perfectly made for beginners.",
    "difficulty": 30,
    "balance": 45,
    "stiff": 10,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/ec531c98-d902-477a-ad0c-f85ce64ef723.jpg?v=1649833746&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "DriveX 1L A",
    "label": "D1LA",
    "cost": 105,
    "brand": "Victor",
    "description": "The Victor DriveX 1L A Badminton Racket is the lightest racket in the DriveX range. This racket combines lightness and flexibility, perfect for all around, intermediate level play.The graphite and resin construction allows this racket to achieve a 5U weight and a 20-24lbs stringing tension, perfect for intermediate level players.This racket arrives to us unstrung (frame only) from the manufacturer. This allows you to customise string and tension to best suit your game. Restring options must be selected on the 'upgrade offers' drop-down menu. ",
    "difficulty": 65,
    "balance": 50,
    "stiff": 35,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/766a6aa5-8eab-42f2-9b9f-9d8b7a9e1026.jpg?v=1660910254&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Thruster K 12",
    "label": "TK12",
    "cost": 149,
    "brand": "Victor",
    "description": "The head heavy TK-12 is perfectly made for offensive games. The Power Box System reduces torsion, which creates powerful, more accurate offensive shots.PowerBox PowerBox technology increases the player's ability to hit with more power combined with the option to string at higher tensions as players progress in experience. Centred at the ‘T’ of the racket, the Box shaped frame increases racket stability by decreasing torsion (frame twisting), with this anti-torque design capable of withstanding higher string tensions.Fibre Reinforced System (FRS) The Fibre Reinforced System (FRS) gives players greater power generation for overhead shots while maintaining control and choice of higher string tensions. The fibre reinforced system is based on multi-layered carbon fibre within the racket shaft, increasing racket bend elasticity (repulsion power)  within the controllability of high string tensions, leading to greater power from your hits.",
    "difficulty": 40,
    "balance": 70,
    "stiff": 35,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/39b5ab09-163b-4989-969c-83a80ea4e67c.jpg?v=1649414616&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Auraspeed Lightfighter 40",
    "label": "AL40",
    "cost": 105,
    "brand": "Victor",
    "description": "The Victor Auraspeed Lightfighter 40 D Badminton Racket is a lightweight but head-heavy racket based on the Auraspeed series. If you're looking for a super fast and lightweight racket that still packs a punch from the rear of the court, then this may be the racket for you.Thanks to the combination of Sword and Ultra Thin Frame technology, air resistance is reduced to a minimum. This racket is a collaboration between two popular Victor racket series; retaining the super lightweight-head heavy balance that has been synonymous with the Lightfighter range, but adding in the aerodynamic frame qualities of Auraspeed, to create even greater speed and manoeuvrability. Suitable for a fast and powerful game",
    "difficulty": 50,
    "balance": 60,
    "stiff": 45,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/c6862196-3cde-4c75-b0ff-e365d8badb22.jpg?v=1682065307&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Thruster K 70",
    "label": "TK70",
    "cost": 115,
    "brand": "Victor",
    "description": "The Victor Thruster K 70 U Badminton Racket is super light at only 70 grams, creating a racket that is very manoeuvrable, allowing you to react quickly and control the game completely.The medium flexible shaft provides control and the head heavy balance for attacking power. The Victor Thruster range is aimed towards pure power play, however the weight of of the K 70 gives a more all-round racket feel that allows for both defensive and attacking speed in ultra-fast doubles games.The NANO TEC technology works by evenly distributing nano-sized particles in the vacant space between carbon fibre bundles, this highly increases the overall stiffness of the carbon composites fibres and reduces the distortion of the frame.The single-pass 76 grommet hole construction creates less friction between strings, this effectively reduces tension loss, while extending string life.Based on the design of multi-layered carbon fibre, the advanced Fibre Reinforced System (FRS) can not only improve the elasticity, but also offer stable controllability with high tension string.",
    "difficulty": 50,
    "balance": 70,
    "stiff": 55,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/93c80812-4415-4903-8684-bec9003ee354.jpg?v=1682065311&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Thruster 220H II",
    "label": "T220H",
    "cost": 120,
    "brand": "Victor",
    "description": "The Victor Thruster 220H II Badminton Racket is a medium flex, slightly head heavy racket, designed for intermediate players and offering great stability, due to the box-shaped design known as Powerbox. This increases stability and reduces tension loss in strings, as well as allowing higher tensions when restringing (up to 35lbs). Features:Free Core - Designed by computer simulation and aided with the adoption of injection moulding technique, this revolutionised handle style allows the shaft to move more freely, which can not only make swings smoother but also improve the overall handling experience.Catapult Structure - Catapult Structure technology stores power and releases at smashing for maximum effect.FRS – Based on multi-layered carbon fibre, the advanced Fibre Reinforced System (FRS) not only improves elasticity, but also offers stable controllability with high-tension string.POWERBOX – The box-shaped design effectively increases the stability and anti-torque, and can stand higher string tensions.SEVEN SIX76 - The single-pass grommet hole construction creates less friction between strings, this effectively reduces tension loss, while extending string life.",
    "difficulty": 70,
    "balance": 70,
    "stiff": 50,
    "url": "https://badmintonhq.co.uk/cdn/shop/files/0e03a520-3821-4838-a305-db2e294dc07f.jpg?v=1690383148&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Auraspeed 9000 C",
    "label": "A9000C",
    "cost": 115,
    "brand": "Victor",
    "description": "The Victor Auraspeed 9000 C Badminton Racket is designed for intermediate level club players, seeking a versatile all-round racket that performs evenly across all shots and areas of the court.As with all rackets in the Auraspeed range, the 9000 C is built for speed, and the Aero-Sword frame cuts through the air to deliver faster swings. The flexible frame and even balance makes this racket a very easy racket to pick up and play with.Victor have also incorporated their free core technology into the racket handle. Replacing the traditional wooden handle, this revolutionary, injection moulded handle style allows the shaft to move more freely and creates smoother swings.Aligned with the beautiful black and pink decal, we expect this racket to be extremely popular, so grab yours quickly before they are all gone!",
    "difficulty": 50,
    "balance": 50,
    "stiff": 40,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/32234f75-0caa-435c-b04b-0d73e84c10f5.jpg?v=1682065312&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Jetspeed S10C",
    "label": "JS10",
    "cost": 220,
    "brand": "Victor",
    "description": "The Victor Jetspeed S10C badminton racket is the latest version in a legendary series of rackets. The Jetspeed S10 is loved by many for it's lightning fast and responsive feel, powered by PYROFIL Japanese carbon fibre. The Jetspeed S10 C features an even balance for equal effectiveness in both defence and attack. The rackets stiff flex maintains a high level of precision and accuracy and will reward good technique and timing with devastating power.Featuring:PYROFIL - Pyrofil carbon fibre and it's composites, are advanced high performance materials from Japan. The characteristic of high intensity, ultra-light bonds offers excelent racket shock absorption and enhances control.NANO FORTIFY - The adoption of the single-wall carbon nanotube effectively enhances racket intensity, elasticity and fatigue resistance. The lightweight enhanced material enables both strength and smooth handling.",
    "difficulty": 75,
    "balance": 50,
    "stiff": 80,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/a519d672-829d-4d49-ad2e-917aa1c71f98.jpg?v=1670407525&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Lightfighter 80A",
    "label": "LF80A",
    "cost": 176,
    "brand": "Victor",
    "description": "The Victor Aurapseed Light Fighter 80 provides a combination of brilliant handling, control and speed!This powerful racket features a head heavy balance on a lightweight frame to offer great speed without sacrificing power. Strung with VBS-70 string, this racket can hold a maximum string tension of up to 28lbs.",
    "difficulty": 60,
    "balance": 55,
    "stiff": 50,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/8c39bd51-596e-488b-a68f-93050f4f4aae.jpg?v=1684853717&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Hang",
    "label": "H",
    "cost": 200,
    "brand": "Victor",
    "description": "The Victor Auraspeed Hang is a limited edition, elite level racket, designed to blend speed, power and precision. The Auraspeed Hang features Victor's latest free core synthetic handle technology for smoother swings and improved vibration dampening. The even balance and stiff frame is suited to advanced players looking to play a solid all round game style.Featuring:FREE CORE - Designed by computer simulation and aided with the adoption of injection moulding technique, this revolutionized handle style allows the shaft to move more freely, which can not only make swings smoother but also improve overall handling experience.COMPOUND SWORD - The compound frame design can be divided into three major parts: The upper section is made with fan-shaped structure to lower wind resistance and accelerate each swing. The Compound-Sword structure in the middle section is designed to lighten the filler and enable fast rebound. Finally, the lower section is built in airfoil structure to lower wind resistance and keep excellent anti-torsion performance in a \"whipping\" style which helps to create steeper and quicker attacks with satisfying control.HARD CORED TECHNOLOGY - Inspired by military helicopter, multi-layered structure made by carbon fiber and composites, minimize material size, reinforce handling feel and performance at a critical standard.SONIC REBOUND TECHNOLOGY - Integrates Rebound Transition Construction and a high-resilience carbon fiber material, maximizing the rebound effect upon impact to help you strike with that extra speed like you never experienced before.SEVENTYSIX - The single-pass grommet hole construction creates less friction between strings, this effectively reduces tension loss, while extending string life.RTC - The Rebound Transition Construction, with science-tested \"Rebound Points\" on specific parts of the racket frame, increases the rebound of the racket to produce more weight and velocity in your strokes.",
    "difficulty": 75,
    "balance": 55,
    "stiff": 80,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/6ba197a4-ecb5-49a3-b985-cfedb74172e2.jpg?v=1673971312&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Auraspeed HS",
    "label": "AHS",
    "cost": 200,
    "brand": "Victor",
    "description": "The Victor Auraspeed HS B badminton racket is an advanced level doubles racket for experienced players who are looking for greater speed and precision.The Auraspeed HS (Hypersonic) has made the classic DYNAMIC-SWORD even lighter and thinner to lower the wind resistance and enable faster hits and returns. Engineered with the innovative new material Nano Fortify SR, the frame of ARS-HS is thin, light, stiff, durable, and fatigue-resistant. The speed and elasticity of the racket has been significantly improved, making ARS-HS a racket that can provide you with both outstanding stiffness and incredible handling experience.The shaft is built with the cutting-edge composite carbon fiber material PYROFIL to make the racket stiff and lightweight. With a diameter of 6.8 mm, the shaft allows for more improvement in speed and enables smooth force transmission and greater controllability.Unlike traditional solid wooden handles, the FREE CORE synthetic handle made with nanotechnology has an innovative hollow structure to improve shock-absorption and create more space for the shaft to flex. It not only allows for smoother hitting and better rebound, but also makes the transition from defense to attack hard for the opponent to be prepared for. The transparent cap exclusively designed by VICTOR further provides a peek into the secret of FREE CORE technology.Featuring:SEVEN SIX 76 - The single-pass grommet hole construction creates less friction between strings, this effectively reduces tension loss, while extending string life. PYROFIL - Pyrofil carbon fibre and it's composites, are advanced high performance materials from Japan. The characteristic of high intensity, ultra-light bonds offers excelent racket shock absorption and enhances control.HARD CORED TECHNOLOGY - Inspired by military helicopters, multi-layered structure made by carbon fiber and composites, minimises material sizes and reinforces handling performance.FREE CORE - Designed by computer simulation and aided with the adoption of injection moulding technique, this revolutionised handle style allows the shaft to move more freely. Swings are not only smoother but the overall feel and handling experience is improved.  COMPOUND SWORD - The compound frame design can be divided into three major parts: The upper section is made with fan shaped structure to lower wind resistance and accelerate each swing. The Compund-Sword structure in the middle section is designed to lighten the filler and enable fast rebound. Finally, the lower section is built in airfoil structure to lower wind resistance and keep excellent anti-torsion performance in a 'whipping' style which helps to create steeper and quicker attacks with satisfying control.NANO FORTIFY - The adoption of the single-wall carbon nanotube effectively enhances racket intensity, elasticity and fatigue resistance. The lightweight enhanced material enables both strength and smooth handling.",
    "difficulty": 75,
    "balance": 50,
    "stiff": 80,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/c6f4c9ea-a930-4ad6-b1ba-2c159f17d8df.jpg?v=1670407519&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "DRIVEX 9X",
    "label": "D9X",
    "cost": 225,
    "brand": "Victor",
    "description": "The Victor Drive X 9X badminton racket is the top model of Drive X series and takes centre stage after 3 years of product development. The Drive X 9X is an even balanced racket, which offers incredible handling and control.This racket is a 4U weight and G5 grip size, suited to advanced level doubles players looking to play a consistent, all round game, balancing speed, power and control in all areas of the court. The stiff shaft offers precision control and excellent power transfer for advanced players.The standout feature of the DriveX 9X is the integration of a the flexible FREE CORE synthetic handle. This revolutionary handle system creates smoother swings with greater handling and feel as the shaft can move more freely. As a key breakthrough among the All-Round series, DriveX 9X not only enables each hit to be stable, comfortable, and effective in releasing power and speed, but also achieves a high degree of control to make attacks crisper and smoother.The DYNAMIC-HEX technology and REBOUND SHIELD frame provides the DriveX 9X with excellent elasticity, not only making swings easier and lighter, but also improving the continuity of the shots.The lightweight, slim shaft (6.6mm) lightens the racket and further enhances swing inertia and power transmission. DriveX 9X is designed with the stiffest shaft among all VICTOR’s rackets, enabling solid and crisp hits and more stable swings.",
    "difficulty": 75,
    "balance": 50,
    "stiff": 75,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/716a1b83-8ea0-4f66-afbd-1164accf6884.jpg?v=1660917158&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Thruster F C",
    "label": "TFC",
    "cost": 225.99,
    "brand": "Victor",
    "description": "The latest, enhanced edition of the extremely popular Thruster F is an advanced level racket suited to hard hitting doubles players. This edition is a 4U weight and is used by 4 x World Champion doubles player Hendra Setiawan. TK-F Enhanced Edition embodies the essence of the efforts made by the Victor R&D team for the past two years. Both of its balance point and swing weight are lighter than the first generation of TK-F, thus further delivering a more comfortable hitting experience. What’s more, the elastic racket frame and stronger shaft make the change of direction smoother, which helps achieve accurate and powerful smashes and incredible controllability. Fully upgraded inside and out, TK-F Enhanced Edition is going to help you make more aggressive attacks.Victor has also introduced it's Free Core injection moulded handle for smoother swings, improved handling and greater feel.The combination of integrated square-head frame and anti- torsion slim shaft provides a larger sweet spot. The smart weight distribution and resilient shaft make it easier to serve and control the shuttlecock, achieving more powerful and effective attacks.Pyrofil Carbon Fibre aids playable time till fatigue, in addition to better control and racket durability for all styles of play. Originating from the car industry, the Japanese Pyrofil ultra-light carbon fibre material and its composites, enhances handling, control and shock absorption through high-intensity, ultra-light bonds. The additional benefit is a core strength, resulting in a reliable racket construction you can trust for years to come.Allowing players to reach their maximal swing speeds and hit shots with greater power, the Tri formation system incorporates Sword, Aerodynamic and Power Box shapes in specific regions of the racket head. Hitting is optimised through the ‘Tri Formations’ integrated technology of reduced air resistance (Sword shape), efficient aerodynamics for acceleration to maximum swing speeds (Aerodynamic shape) and the ability to hit with more power as the racket is stabilised in an anti-toque design capable of withstanding higher string tensions (PowerBox shape).Anti torsion system technologies enables players to hit at maximum muscle power, through reduced power loss as energy generated by you is efficiently passed to the shuttle. Acting through a small angle twist in the ferrel, the smaller angle of torsion (twisting) in the shaft material helps the handle not twist, providing optimal power transmission and anti torsion performance as power is not lost but efficiently passed on.Hard Cored Technology provides players with optimal racket handling helping to increase your shot responsiveness. Inspired by helicopter rotor blade technology, a structure of multilayer carbon fibre and its composites, retains racket stiffness but minimises material size, reinforcing racket handling and performance.Please note that Victor does not include a racket cover with this racket",
    "difficulty": 85,
    "balance": 55,
    "stiff": 70,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/f5e216a0-633f-4e2b-a977-2a21fb5ab7d7.jpg?v=1660924259&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Thruster K R",
    "label": "TKR",
    "cost": 200,
    "brand": "Victor",
    "description": "The Victor Thruster K R 3U badminton racket is the most user friendly out of the premium Thruster range and is suited to a wide range of player abilities. The flexible shaft helps to generate whipping power with greater ease, and so when mixed with the 88g weight and head heavy balance this racket is best for those seeking power from the rear court. The Thruster K R features Victor's latest technology including the innovative Free Core handle and has been brought into Europe in limited numbers, as a one-shot order, so will be extremely rare in the UK.FeaturingPower Box - The box shaped design effectively increases the stability and anti-torque, can stand stand higher string tension.SEVEN SIX 76 - The single-pass grommet hole construction creates less friction between strings, this effectively reduces tension loss, while extending string life. PYROFIL - Pyrofil carbon fibre and it's composites, are advanced high performance materials from Japan. The characteristic of high intensity, ultra-light bonds offers excelent racket shock absorption and enhances control.HARD CORED TECHNOLOGY - Inspired by military helicopters, multi-layered structure made by carbon fiber and composites, minimises material sizes and reinforces handling performance.FREE CORE - Designed by computer simulation and aided with the adoption of injection moulding technique, this revolutionised handle style allows the shaft to move more freely. Swings are not only smoother but the overall feel and handling experience is improved.",
    "difficulty": 65,
    "balance": 75,
    "stiff": 55,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/1cd894d6-ffde-42c7-888e-e5d4bd961a0c.jpg?v=1671548147&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Auraspeed 100X H",
    "label": "A100X",
    "cost": 240,
    "brand": "Victor",
    "description": "The Victor Auraspeed 100 X H Badminton Racket is the flagship of Victor's speed series. The weapon of choice for legendary doubles player Mohammad Ahsan, the Auraspeed 100X delivers explosive speed, coupled with precision accuracy for advanced players. Featuring:PYROFIL - High performance carbon fibre from Japan that offers excellent shock absorption and enhances handling.Nano Fortify TR+ - Introducing the TORAYCA®PREPREG material from Toray, a leading carbon fiber manufacturer from Japan, NANO FORTIFY TR not only upgrades the elasticity and impact resistance, but also enables excellent exercise performance, which further provides greater repulsion, easy-yet-smooth shot-making, and advanced racket-handling.experience.RTC - The Rebound Transition Construction, with science tested 'rebound points' on specific parts of the racket frame, increases the rebound of the racket to produce more weight and velocity in your shots.Sonic-Rebound Technology - The Sonic Rebound Technology integrates Rebound Transition Construction and a high-resilience carbon fiber material, maximizing the rebound effect upon impact to help you strike with that extra speed like you never experienced before.Dynamic Sword - Based on the principles of aerodynamics, the DYNAMIC-SWORD is further upgraded from the SWORD by adjusting different positions on the frame accordingly: 12 and 6 o’clock positions are made inward; 3 and 9 o’clock positions are made outward. The blade-like frame structure has a larger sectional area to direct airflow, making returns faster and smoother.Rebound Shield - Introducing highly resilient and durable glass fiber into the multilayered design of the frame to provide better elasticity and comfort during hitting.Free Core - Designed by computer simulation and aided with the adoption of injection moulding technique, this revolutionized handle style, moving away from the traditional wood used on the majority of rackets. Free Core allows the shaft to move more freely, which can not only make swings smoother but also improve overall handling experience. Power Ring - The integrated force of the shaft and FREECORE creates a sturdy handling and phenomenal elasticity.Shaft Recovery System - The recovery performance enhanced by high modulus material unleashes the shaft’s elasticity potential and creates fast rebound.",
    "difficulty": 80,
    "balance": 40,
    "stiff": 65,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/c1847316-f82c-41f5-bcfd-9a5ff4e7c3be.jpg?v=1660134833&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Auraspeed 90K",
    "label": "A90K",
    "cost": 230,
    "brand": "Victor",
    "description": "Introducing the next step for the Auraspeed 90k, the Victor Auraspeed 90K II, the weapon of choice for European Champion Anders Antonsen. Unlike most premium rackets, Victor has implemented their Whipping Enhancement System, allowing the 90K II frame to whip and flex on each shot, adding extra power and angles to your shoots whilst retaining high-end control. This makes the Auraspeed 90K II a  much more forgiving and user-friendly racket that can benefit a wider range of different playstyles. Hard Cored Technology Hard-cored technology provides players with optimal racket handling helping to increase their shot responsiveness. Inspired by helicopter rotor blade technology, a structure of multilayer carbon fibre and its composites, retains racket stiffness but minimises material size, reinforcing racket handling and performance.PyrofilPyrofil Carbon Fibre aids playable time till fatigue, in addition to better control and racket durability for all styles of play. Originating from the car industry, the Japanese Pyrofil ultra-light carbon fibre material and its composites enhance handling, control and shock absorption through high-intensity, ultra-light bonds. The additional benefit is a core strength, resulting in a reliable racket construction you can trust for years to come.Nano Fortify TR+Nano Fortify TR+ builds on Nano Fortify technology allowing players to generate accurate attacking power shots in responsive fast-paced rallies with the added benefits of improved racket durability, resilience and hand-feel. Built into the whole racket frame, Nano fortify TR+ provides advanced more durable carbon fibre, enabling it to generate bending strength and high repulsion power through the composition of tube-shaped carbon fibres. Therefore, retaining the accuracy of a stiff frame, optimised repulsion power and racket durability.Dynamic SwordSurprise your opponents with accurate swift sharp shots, as Dynamic sword technology raises your ability in attacking fast-paced styles of play. Dynamic Sword frames incorporate two distinct aerodynamic shapes that imitate a sword blade as it cuts through the air. The first shape, located at the top and bottom of the racket head (6/12 o’clock direction) features an inward-cutting frame, complimented by the secondary shape of an outward-cutting frame structure located on the left and right mid points of the racket head (3/9 o’clock direction). Therefore the Dynamic Sword shape leads to greater frame aerodynamics and reduced torsion (twisting), resulting in accurate swift attacks.Whipping Enhancement System (WES)The Whipping Enhancement System (WES) improves both the speed and steepness of your attacking shots (eg: smashes) without compromising control. This softer material, located in a specific part of the shaft stem near the throat enhances racket-head acceleration via a ‘whipping style’, creating faster, steeper attacks, with satisfying control.",
    "difficulty": 85,
    "balance": 40,
    "stiff": 90,
    "url": "https://badmintonhq.co.uk/cdn/shop/files/405fd9ec-e196-42e0-8dfc-3d529c7b78d9.jpg?v=1683725232&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Thruster Ryuga TD",
    "label": "TR",
    "cost": 260,
    "brand": "Victor",
    "description": "The Victor Thruster Ryuga TD Badminton Racket is for advanced players, looking for a high-end racket offering a high level of power, without losing out on control and precision. With a stiff shaft and head-heavy balance, this racket allows you to place your shots to perfection without sacrificing power, with added Powerbox technology to increase stability and allow for higher tension stringing (30lbs). Features:Free Core - Designed by computer simulation and aided with the adoption of injection moulding technique, this revolutionised handle style allows the shaft to move more freely, which can not only make swings smoother but also improve the overall handling experience.Hard Cored Technology - Inspired by Helicopter rotor blade technology – the multi-layered structure made of carbon fibre and composites, minimises material size and reinforces handling feel and performance.POWERBOX – The box-shaped design effectively increases the stability and anti-torque, and can stand higher string tensions.SEVEN SIX76 - The single-pass grommet hole construction creates less friction between strings, this effectively reduces tension loss, while extending string life.",
    "difficulty": 75,
    "balance": 70,
    "stiff": 75,
    "url": "https://badmintonhq.co.uk/cdn/shop/files/748f5541-4a67-4135-ad7e-1b5f0519f12d.jpg?v=1690383145&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Auraspeed LJH S",
    "label": "ALJH",
    "cost": 0,
    "brand": "Victor",
    "description": "The Victor Auraspeed LJH Badminton Racket is for experienced players, looking for a racket offering a great blend of control, power and precision. With a stiff shaft and head heavy balance, this racket allows you to place your shots to perfection without sacrificing power. Features:Free Core - Designed by computer simulation and aided with the adoption of injection moulding technique, this revolutionised handle style allows the shaft to move more freely, which can not only make swings smoother but also improve the overall handling experience.Hard Cored Technology - Inspired by Helicopter rotor blade technology – the multi-layered structure made of carbon fibre and composites, minimises material size and reinforces handling feel and performance.Compound Sword - The compound frame design can be divided into three major parts: The upper section is made with a fan-shaped structure to lower wind resistance and accelerate each swing. The Compound-Sword structure in the middle section is designed to lighten the filler and enable fast rebound. Finally, the lower section is built in an aerofoil structure to lower wind resistance and keep excellent anti-torsion performance in a “whipping” style which helps to create steeper and quicker attacks with satisfying control.RTC – R.T.C. technology, based on scientifically-designed structure and data analysis, introduces a “reflection point” to the frame’s key spots to maximise the “rebound” performance, effectively improving both the quality and speed of each swing.Sonic Rebounding Technology – Integrates R.T.C. with highly resilient modulus graphite material to enable swift and all-around rebound performance, redefining what a SPEED racket could be.SEVEN SIX76 - The single-pass grommet hole construction creates less friction between strings, this effectively reduces tension loss, while extending string life.",
    "difficulty": 70,
    "balance": 70,
    "stiff": 75,
    "url": "https://badmintonhq.co.uk/cdn/shop/files/f23742e4-2cf8-4f98-8b29-9e0af63d9855.jpg?v=1690383148&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Auraspeed 9A",
    "label": "A9A",
    "cost": 85,
    "brand": "Victor",
    "description": "The Victor Auraspeed 9A badminton racket is a favourite with beginner/intermediate level doubles players looking for an all-round racket that is forgiving and easy to use.The Auraspeed 9A's flexible shaft helps to deliver easier power for those still developing racket swing speed and the even balance is comfortable to use in both defence and attack.Featuring:COMPOUND SWORD - The compound frame design can be divided into three major parts: The upper section is made with fan shaped structure to lower wind resistance and accelerate each swing. The Compund-Sword structure in the middle section is designed to lighten the filler and enable fast rebound. Finally, the lower section is built in airfoil structure to lower wind resistance and keep excellent anti-torsion performance in a 'whipping' style which helps to create steeper and quicker attacks with satisfying control.SEVEN SIX 76 - The single-pass grommet hole construction creates less friction between strings, this effectively reduces tension loss, while extending string life. ",
    "difficulty": 40,
    "balance": 50,
    "stiff": 25,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/56f3b05f-f4c1-42fb-b23d-902ead00095f.jpg?v=1670407520&width=600",
    "favourites": [],
    "bestSelling": false
  },
  {
    "name": "Auraspeed 9A",
    "label": "A9A",
    "cost": 85,
    "brand": "Victor",
    "description": "The Victor Auraspeed 9A badminton racket is a favourite with beginner/intermediate level doubles players looking for an all-round racket that is forgiving and easy to use.The Auraspeed 9A's flexible shaft helps to deliver easier power for those still developing racket swing speed and the even balance is comfortable to use in both defence and attack.Featuring:COMPOUND SWORD - The compound frame design can be divided into three major parts: The upper section is made with fan shaped structure to lower wind resistance and accelerate each swing. The Compund-Sword structure in the middle section is designed to lighten the filler and enable fast rebound. Finally, the lower section is built in airfoil structure to lower wind resistance and keep excellent anti-torsion performance in a 'whipping' style which helps to create steeper and quicker attacks with satisfying control.SEVEN SIX 76 - The single-pass grommet hole construction creates less friction between strings, this effectively reduces tension loss, while extending string life. ",
    "difficulty": 40,
    "balance": 50,
    "stiff": 25,
    "url": "https://badmintonhq.co.uk/cdn/shop/products/56f3b05f-f4c1-42fb-b23d-902ead00095f.jpg?v=1670407520&width=600",
    "favourites": [],
    "bestSelling": false
  }
]